Imports

In [10]:
import pandas as pd
import re

Load CSV

In [11]:
df_students = pd.read_csv('bi.csv', encoding='latin1')

DataFrame info

In [12]:
df_students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   fNAME          77 non-null     object
 1   lNAME          77 non-null     object
 2   Age            77 non-null     int64
 3   gender         77 non-null     object
 4   country        77 non-null     object
 5   residence      77 non-null     object
 6   entryEXAM      77 non-null     int64
 7   prevEducation  77 non-null     object
 8   studyHOURS     77 non-null     int64
 9   Python         75 non-null     float64
 10  DB             77 non-null     int64
dtypes: float64(1), int64(4), object(6)
memory usage: 6.7+ KB

In [13]:
df_students.head()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80

Verify empty rows

In [14]:
df_students.isnull().sum()

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           2
DB               0
dtype: int64

Rename columns

In [15]:
df_students.rename( columns={
    'fNAME' : 'first_name',
    'lNAME' : 'last_name',
    'Age' : 'age',
    'entryEXAM' : 'entry_exam_score',  
    'studyHOURS' : 'study_hours',  
    'prevEducation' : 'previous_education',  
    'Python' : 'python_exam_score',  
    'DB' : 'database_exam_score'
}, inplace=True)

df_students.columns

Index(['first_name', 'last_name', 'age', 'gender', 'country', 'residence',
       'entry_exam_score', 'previous_education', 'study_hours',
       'python_exam_score', 'database_exam_score'],
      dtype='object')

Replace inconsistent country names

In [22]:
def replaceCountryNames(country):
    replacements = {
        'uk' : 'United Kingdom',
        'norge' : 'RSA',
        'rsa' : 'South Africa'
    }

    for old, new in replacements.items():
        country = re.sub(old,new,country, flags=re.IGNORECASE).capitalize()
    return country

df_students['country'] = df_students['country'].apply(replaceCountryNames).copy()

df_students['country'].unique()

array(['Norway', 'Kenya', 'Uganda', 'South africa', 'Denmark',
       'Netherlands', 'Italy', 'Spain', 'United kingdom', 'Somali',
       'Nigeria', 'Germany', 'France'], dtype=object)

In [ ]:
for i, row in df_students.iterrows():
    print (row['country'])

Gender value noise

In [24]:
df_students['gender'].unique()

array(['Female', 'M', 'Male', 'F', 'female', 'male'], dtype=object)

In [25]:
df_students['gender'] = df_students['gender'].replace(
    ['F', 'female'], 'Female'
)

df_students['gender'] = df_students['gender'].replace(
    ['M', 'male'], 'Male'
)

df_students['gender'].unique()

array(['Female', 'Male'], dtype=object)

Normalize previous education

In [26]:
df_students['previous_education'].unique()

array(['Masters', 'Diploma', 'HighSchool', 'High School', 'Bachelors',
       'Barrrchelors', 'diploma', 'DIPLOMA', 'Diplomaaa', 'Doctorate'],
      dtype=object)

In [53]:
def normalize_previous_education(text):
    subs = {
    r'^high\s*school' : 'High School',
    r'Bar*chelors' :  'Bachelors',
    r'diplom[a]*' : 'Diploma',
    }  
    for pattern, repl in subs.items():
        text = re.sub(pattern, repl, text, flags=re.IGNORECASE)
    return text

df_students['previous_education'] =  df_students['previous_education'].apply(normalize_previous_education)

df_students['previous_education'].unique()

array(['Masters', 'Diploma', 'High School', 'Bachelors', 'Doctorate'],
      dtype=object)